Repository: littleseven/polang
Catalog: iosApp/PoLang/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr, zh_hans, zh_hant

source: Relaxed and fun, with light emoji use
es: Relajado y divertido, con uso moderado de emojis
fr: Détendu et amusant, avec un usage léger des émojis
zh_hans: 轻松俏皮，适度使用 emoji
zh_hant: 輕鬆俏皮，適度使用 emoji

source: Release build records metrics only.
es: La compilación de release solo registra métricas.
fr: La build Release n'enregistre que des métriques.
zh_hans: Release 构建仅记录指标。
zh_hant: Release 版本僅記錄指標。

source: Remote Inference
es: Inferencia remota
fr: Inférence à distance
zh_hans: 远程推理
zh_hant: 遠端推理

source: Remote Model
es: Modelo remoto
fr: Modèle distant
zh_hans: 远程模型
zh_hant: 遠端模型

source: Remote Models
es: Modelos remotos
fr: Modèles distants
zh_hans: 远程模型
zh_hant: 遠端模型

source: Remote model providers, API keys, and the active model.
es: Proveedores de modelos remotos, claves API y el modelo activo.
fr: Fournisseurs de modèles distants, clés API et modèle actif.
zh_hans: 远程模型供应商、API 密钥与当前选用模型。
zh_hant: 遠端模型供應商、API 金鑰與目前選用模型。

source: Rename
es: Renombrar
fr: Renommer
zh_hans: 重命名
zh_hant: 重新命名

source: Rendering
es: Renderizado
fr: Rendu
zh_hans: 渲染
zh_hant: 渲染

source: Reprocess everything
es: Reprocesar todo
fr: Retraiter tout
zh_hans: 全部重新处理
zh_hant: 全部重新處理

source: Reprocess everything?
es: ¿Reprocesar todo?
fr: Retraiter tout ?
zh_hans: 全部重新处理？
zh_hant: 全部重新處理？

source: Request
es: Solicitud
fr: Requête
zh_hans: 请求
zh_hant: 請求

source: Rescan all
es: Reescanear todo
fr: Tout réanalyser
zh_hans: 全量重扫
zh_hant: 全量重掃

source: Reset
es: Restablecer
fr: Réinitialiser
zh_hans: 重置
zh_hant: 重設

source: Response
es: Respuesta
fr: Réponse
zh_hans: 响应
zh_hant: 回應

source: Result
es: Resultado
fr: Résultat
zh_hans: 结果
zh_hant: 結果

source: Resume
es: Reanudar
fr: Reprendre
zh_hans: 继续
zh_hant: 繼續

source: Retry
es: Reintentar
fr: Réessayer
zh_hans: 重试
zh_hant: 重試

source: Sandbox & Permissions
es: Sandbox y permisos
fr: Bac à sable et autorisations
zh_hans: 沙盒与权限
zh_hant: 沙盒與權限

source: Saturation
es: Saturación
zh_hans: 饱和度
zh_hant: 飽和度

source: Save
es: Guardar
fr: Enregistrer
zh_hans: 保存
zh_hant: 儲存

source: Scan
es: Escanear
fr: Analyser
zh_hans: 扫描
zh_hant: 掃描

source: Scan new
es: Escanear nuevas
fr: Analyser les nouveaux
zh_hans: 扫描新增
zh_hant: 掃描新增

source: Scan status
es: Estado del escaneo
fr: État de l'analyse
zh_hans: 扫描状态
zh_hant: 掃描狀態

source: Scenes
es: Escenas
fr: Scènes
zh_hans: 场景
zh_hant: 場景

source: Search Test
es: Prueba de búsqueda
fr: Test de recherche
zh_hans: 搜索测试
zh_hant: 搜尋測試

source: Search beach photos
es: Buscar fotos de playa
fr: Rechercher des photos de plage
zh_hans: 搜索海边的照片
zh_hant: 搜尋海邊的照片

source: Search for night scene photos
es: Buscar fotos de escenas nocturnas
fr: Rechercher des photos de scènes nocturnes
zh_hans: 搜索夜景照片
zh_hant: 搜尋夜景照片

source: Search history
es: Historial de búsqueda
fr: Historique de recherche
zh_hans: 搜索历史
zh_hant: 搜尋歷史

source: Search keywords (empty = curated)
es: Palabras clave de búsqueda (vacío = curadas)
fr: Mots-clés de recherche (vide = sélection par défaut)
zh_hans: 搜索关键词，留空加载精选
zh_hant: 搜尋關鍵詞，留空載入精選

source: Search night scenes
es: Buscar escenas nocturnas
fr: Rechercher des scènes nocturnes
zh_hans: 搜索夜景照片
zh_hant: 搜尋夜景照片

source: Search, edit, beautify — ask me anything!
es: Busca, edita, embellece — ¡pregúntame lo que quieras!
fr: Rechercher, retoucher, embellir — posez-moi toutes vos questions !
zh_hans: 我能搜相册·修图·调美颜·找人找场景，随便问！
zh_hant: 我能搜相簿·修圖·調美顏·找人找場景，隨便問！

# Select Model
source: Choose Model
es: Elegir modelo
fr: Choisir un modèle
zh_hans: 选择模型
zh_hant: 選擇模型

source: Select cover
es: Elegir portada
fr: Choisir la couverture
zh_hans: 选择封面
zh_hant: 選擇封面

source: Selected %lld
es: %lld seleccionadas
fr: %lld sélectionnées
zh_hans: 已选择 %lld 项
zh_hant: 已選擇 %lld 項

source: Semantic
es: Semántica
fr: Sémantique
zh_hans: 语义
zh_hant: 語義

source: Semantic Search
es: Búsqueda semántica
fr: Recherche sémantique
zh_hans: 语义搜索
zh_hant: 語意搜尋

source: Send
es: Enviar
fr: Envoyer
zh_hans: 发送
zh_hant: 傳送

source: Send Code
es: Enviar código
fr: Envoyer le code
zh_hans: 发送验证码
zh_hant: 發送驗證碼

source: Sending…
es: Enviando…
fr: Envoi…
zh_hans: 发送中…
zh_hant: 發送中…

source: Settings
es: Ajustes
fr: Réglages
zh_hans: 设置
zh_hant: 設定

source: Shader Debug Mode
es: Modo de depuración de shaders
fr: Mode débogage des shaders
zh_hans: 着色器调试模式
zh_hant: 著色器除錯模式

source: Share
es: Compartir
fr: Partager
zh_hans: 分享
zh_hant: 分享

source: Show Camera Info
es: Mostrar información de la cámara
fr: Afficher les infos de l'appareil photo
zh_hans: 显示相机信息
zh_hant: 顯示相機資訊

source: Show Face Debug
es: Mostrar depuración de rostro
fr: Afficher le débogage visage
zh_hans: 显示人脸调试
zh_hant: 顯示人臉調試

source: Show Face Landmarks
es: Mostrar puntos faciales
fr: Afficher les points clés du visage
zh_hans: 显示人脸关键点
zh_hant: 顯示人臉關鍵點

source: Show Log Overlay
es: Mostrar superposición de registros
fr: Afficher les logs en surimpression
zh_hans: 显示日志浮层
zh_hant: 顯示日誌浮層

source: Show all people
es: Mostrar todas las personas
fr: Afficher toutes les personnes
zh_hans: 显示全部人物
zh_hant: 顯示全部人物

source: Sign in for more quota and features
es: Inicia sesión para más cuota y funciones
fr: Connectez-vous pour plus de quota et de fonctionnalités
zh_hans: 注册账号享受更多额度与功能
zh_hant: 註冊帳號享有更多額度與功能

source: Sign up with email · Get free quota
es: Regístrate con tu correo · Obtén cuota gratuita
fr: Inscrivez-vous par e-mail · Obtenez un quota gratuit
zh_hans: 邮箱注册 · 领免费额度
zh_hant: 信箱註冊 · 領免費額度

source: Skin Mask
es: Máscara de piel
fr: Masque de peau
zh_hans: 皮肤蒙版
zh_hant: 皮膚遮罩

source: Skips already-processed photos · fastest
es: Omite las fotos ya procesadas · lo más rápido
fr: Ignore les photos déjà traitées · le plus rapide
zh_hans: 跳过已处理的照片，速度最快
zh_hant: 跳過已處理的照片，速度最快

source: Slim Face
es: Adelgazar rostro
fr: Amincissement du visage
zh_hans: 瘦脸
zh_hant: 瘦臉

source: Smoothing
es: Suavizado
fr: Lissage
zh_hans: 磨皮
zh_hant: 磨皮

source: Source
es: Origen
zh_hans: 来源
zh_hant: 來源

source: Speech
es: Habla
fr: Parole
zh_hans: 语音模型
zh_hant: 語音模型

source: Stages
es: Etapas
fr: Étapes
zh_hans: 分阶段
zh_hant: 分階段

source: Start
es: Iniciar
fr: Démarrer
zh_hans: 开始
zh_hant: 開始

source: Stop
es: Detener
fr: Arrêter
zh_hans: 停止
zh_hant: 停止

source: Stored only; preview rendering does not consume this setting yet.
es: Solo se guarda; el renderizado de la vista previa aún no usa este ajuste.
fr: Stocké uniquement ; le rendu de l'aperçu n'utilise pas encore ce réglage.
zh_hans: 仅持久化保存；预览渲染暂不使用此设置。
zh_hant: 僅持久化保存；預覽渲染暫不使用此設定。

source: Straight to conclusions, minimal pleasantries
es: Directo a las conclusiones, sin preámbulos
fr: Droit aux conclusions, un minimum de politesses
zh_hans: 直给结论，少寒暄
zh_hant: 直給結論，少寒暄

source: Stroke width
es: Grosor del trazo
fr: Épaisseur du trait
zh_hans: 笔画粗细
zh_hant: 筆畫粗細

source: Structured Output
es: Salida estructurada
fr: Sortie structurée
zh_hans: 结构化输出
zh_hant: 結構化輸出

source: Success
es: Éxito
fr: Succès
zh_hans: 成功
zh_hant: 成功

source: Summary
es: Resumen
fr: Résumé
zh_hans: 摘要
zh_hant: 摘要

source: Sunny
es: Soleado
fr: Ensoleillé
zh_hans: 晴天
zh_hant: 晴天

source: Swimwear
es: Traje de baño
fr: Maillot de bain
zh_hans: 泳装
zh_hant: 泳裝

source: System Default
es: Predeterminado del sistema
fr: Valeur par défaut du système
zh_hans: 系统默认
zh_hant: 系統預設

source: Tag scanning, people clustering, tags & duplicates
es: Escaneo de etiquetas, agrupación de personas, etiquetas y duplicados
fr: Analyse des étiquettes, regroupement des personnes, étiquettes & doublons
zh_hans: 打标扫描、人脸聚类、标签与重复图管理。
zh_hant: 打標掃描、人臉聚類、標籤與重複圖管理。

source: Tagging
es: Etiquetado
fr: Étiquetage
zh_hans: 打标
zh_hant: 打標

source: Tagging model
es: Modelo de etiquetado
fr: Modèle d'étiquetage
zh_hans: 打标模型
zh_hant: 打標模型

source: Tags
es: Etiquetas
fr: Étiquettes
zh_hans: 标签
zh_hant: 標籤

source: Tap a stage to manage
es: Toca una etapa para gestionarla
fr: Touchez une étape pour la gérer
zh_hans: 点按阶段进行管理
zh_hant: 點按階段進行管理

source: Tap to set cover
es: Toca para establecer la portada
fr: Touchez pour définir la couverture
zh_hans: 点击设置封面
zh_hant: 點擊設置封面

source: Temperature
es: Temperatura
fr: Température
zh_hans: 色温
zh_hant: 色溫

source: Text
es: Texto
fr: Texte
zh_hans: 文字
zh_hant: 文字

source: Theme
es: Tema
fr: Thème
zh_hans: 主题模式
zh_hant: 主題模式

source: ThinFace Radius
es: Radio de ThinFace
fr: Rayon ThinFace
zh_hans: 瘦脸半径
zh_hant: 瘦臉半徑

source: Thirds
es: Tercios
fr: Tiers
zh_hans: 三分
zh_hant: 三分

source: This is me
es: Soy yo
fr: C'est moi
zh_hans: 这是我
zh_hant: 這是我

source: This person is my…
es: Esta persona es mi…
fr: Cette personne est mon…
zh_hans: TA 是我的…
zh_hant: TA 是我的…

source: This stage will redo all photos and may take a while.
es: Esta etapa reprocesará todas las fotos y puede tardar un poco.
fr: Cette étape va retraiter toutes les photos et peut prendre du temps.
zh_hans: 该阶段将重做全部照片，可能需要较长时间。
zh_hant: 該階段將重做全部照片，可能需要較長時間。

source: Time range
es: Rango de tiempo
fr: Période
zh_hans: 时间范围
zh_hant: 時間範圍

source: Tint
es: Matiz
fr: Teinte
zh_hans: 色调
zh_hant: 色調

source: Tool
es: Herramienta
fr: Outil
zh_hans: 工具
zh_hant: 工具

source: Trace
es: Seguimiento
zh_hans: 追踪
zh_hant: 追蹤

source: Translation
es: Traducción
fr: Traduction
zh_hans: 翻译
zh_hant: 翻譯

source: Trial quota used up. Register to get 1000 free calls.
es: Cuota de prueba agotada. Regístrate para obtener 1000 llamadas gratis.
fr: Quota d'essai épuisé. Inscrivez-vous pour obtenir 1000 appels gratuits.
zh_hans: 试用额度已用完，注册即可获得 1000 次免费额度。
zh_hant: 試用額度已用完，註冊即可獲得 1000 次免費額度。

source: Try these:
es: Prueba esto:
fr: Essayez :
zh_hans: 试试这些：
zh_hant: 試試這些：

source: Type
es: Tipo
zh_hans: 类型
zh_hant: 類型

source: Unavailable
es: No disponible
fr: Indisponible
zh_hans: 不可用
zh_hant: 不可用

source: Understand
es: Entender
fr: Comprendre
zh_hans: 理解
zh_hant: 理解

source: Unknown
es: Desconocido
fr: Inconnu
zh_hans: 未知
zh_hant: 未知

source: Up to date
es: Actualizado
fr: À jour
zh_hans: 已完成
zh_hant: 已完成

source: Use my own Token
es: Usar mi propio token
fr: Utiliser mon propre Token
zh_hans: 配置自己的 Token
zh_hant: 配置自己的 Token

source: Use remote model for natural language camera control.
es: Usa un modelo remoto para controlar la cámara con lenguaje natural.
fr: Utiliser un modèle distant pour contrôler l'appareil photo en langage naturel.
zh_hans: 使用远程模型，启用自然语言控制相机功能。
zh_hant: 使用遠端模型，啟用自然語言控制相機功能。

source: Verification Code
es: Código de verificación
fr: Code de vérification
zh_hans: 验证码
zh_hant: 驗證碼

source: Verify & Sign In
es: Verificar e iniciar sesión
fr: Vérifier & se connecter
zh_hans: 验证并登录
zh_hant: 驗證並登入

source: Verifying…
es: Verificando…
fr: Vérification…
zh_hans: 验证中…
zh_hant: 驗證中…

source: Version
es: Versión
zh_hans: 版本
zh_hant: 版本

source: Video
es: Vídeo
fr: Vidéo
zh_hans: 视频
zh_hant: 影片

source: View All
es: Ver todo
fr: Tout voir
zh_hans: 查看全部
zh_hant: 查看全部

source: View Full Privacy Policy
es: Ver política de privacidad completa
fr: Voir la politique de confidentialité complète
zh_hans: 查看完整隐私政策
zh_hant: 查看完整隱私權政策

source: View, edit, delete AI remembered facts
es: Ver, editar y eliminar datos recordados por la IA
fr: Voir, modifier, supprimer les faits mémorisés par l'IA
zh_hans: 查看、编辑、删除 AI 记住的事实
zh_hant: 查看、編輯、刪除 AI 記住的事實

source: Vision
es: Visión
zh_hans: 图像理解
zh_hant: 圖像理解

source: Vision LLM
es: LLM de visión
fr: LLM de vision
zh_hans: 视觉大模型
zh_hant: 視覺大模型

source: Voice
es: Voz
fr: Voix
zh_hans: 语音
zh_hant: 語音

source: Voice Control
es: Control por voz
fr: Contrôle vocal
zh_hans: 语音控制
zh_hant: 語音控制

source: Voice Mode
es: Modo de voz
fr: Mode vocal
zh_hans: 语音交互模式
zh_hant: 語音互動模式

source: Voice interaction mode
es: Modo de interacción por voz
fr: Mode d'interaction vocale
zh_hans: 语音交互模式
zh_hant: 語音互動模式

source: Wake Word
es: Palabra de activación
fr: Mot d'activation
zh_hans: 唤醒词
zh_hant: 喚醒詞

source: Wake word
es: Palabra de activación
fr: Mot d'activation
zh_hans: 唤醒词
zh_hant: 喚醒詞

source: Warm & Caring
es: Cálido y atento
fr: Chaleureux & bienveillant
zh_hans: 温暖贴心
zh_hant: 溫暖貼心

source: Warp Offset
es: Desplazamiento del warp
fr: Décalage de déformation
zh_hans: 形变偏移
zh_hant: 形變偏移

source: Warp Strength
es: Intensidad del warp
fr: Force de déformation
zh_hans: 形变强度
zh_hant: 形變強度

source: Warp strength magnifies the slim delta. 1.0 = default (subtle); raise it to test if slim is too weak to see.
es: La intensidad del warp amplía el delta de adelgazamiento. 1.0 = valor predeterminado (sutil); súbelo para probar si el adelgazamiento es demasiado leve para notarse.
fr: La force de déformation amplifie l'effet d'amincissement. 1.0 = valeur par défaut (subtile) ; augmentez-la pour tester si l'amincissement est trop faible pour être visible.
zh_hans: 形变强度放大瘦脸位移。1.0=默认（较微弱）；调高可测试瘦脸是否因强度不足而不可见。
zh_hant: 形變強度放大瘦臉位移。1.0=預設（較微弱）；調高可測試瘦臉是否因強度不足而不可見。

source: When disabled, Agent requires confirmation before executing multi-step plans.
es: Cuando está desactivado, el Agente pide confirmación antes de ejecutar planes de varios pasos.
fr: Lorsqu'il est désactivé, l'Agent demande une confirmation avant d'exécuter des plans multi-étapes.
zh_hans: 关闭后，Agent 执行多步骤计划前会要求确认。
zh_hant: 關閉後，Agent 執行多步驟計劃前會要求確認。

source: White Balance
es: Balance de blancos
fr: Balance des blancs
zh_hans: 白平衡
zh_hant: 白平衡

source: Whitening
es: Blanqueamiento
fr: Éclaircissement
zh_hans: 美白
zh_hant: 美白

source: Without a configured model, PoLang uses a free proxy server with limited guest quota. Add your own API key for unlimited access.
es: Sin un modelo configurado, PoLang usa un servidor proxy gratuito con cuota limitada de invitado. Añade tu propia clave de API para acceso ilimitado.
fr: Sans modèle configuré, PoLang utilise un serveur proxy gratuit avec un quota d'invité limité. Ajoutez votre propre clé API pour un accès illimité.
zh_hans: 未配置模型时，PoLang 使用免费代理服务器（访客额度有限）。添加自有 API Key 可解除限制。
zh_hant: 未設定模型時，PoLang 使用免費代理伺服器（訪客額度有限）。新增自有 API Key 可解除限制。

source: Yes
es: Sí
fr: Oui
zh_hans: 是
zh_hant: 是

source: You
es: Tú
fr: Vous
zh_hans: 你
zh_hant: 你

source: You can delete your account through Settings → Account → Delete Account, or by emailing us.
es: Puedes eliminar tu cuenta en Ajustes → Cuenta → Eliminar cuenta, o escribiéndonos un correo.
fr: Vous pouvez supprimer votre compte via Réglages → Compte → Supprimer le compte, ou en nous écrivant par e-mail.
zh_hans: 您可以通过「设置 → 账号 → 删除账号」删除账号，或邮件联系我们。
zh_hant: 您可以透過「設定 → 帳號 → 刪除帳號」刪除帳號，或來信聯絡我們。

source: You've chatted %lld rounds with me 🎉 Register to claim free quota, or configure your own LLM Token — either works to keep chatting!
es: Has chateado %lld rondas conmigo 🎉 Regístrate para conseguir cuota gratuita o configura tu propio token de LLM — cualquier opción sirve para seguir chateando.
fr: Vous avez discuté %lld tours avec moi 🎉 Inscrivez-vous pour obtenir un quota gratuit ou configurez votre propre Token LLM — les deux solutions permettent de continuer à discuter !
zh_hans: 你已经和我聊了 %lld 轮啦 🎉 注册可领取免费额度，或配置自己的 LLM Token，二选一即可继续畅聊～
zh_hant: 你已經和我聊了 %lld 輪啦 🎉 註冊可領取免費額度，或配置自己的 LLM Token，二選一即可繼續暢聊～

source: Your email is used only for authentication and LLM free trial usage counting (default 100 times). No passwords are collected — login uses email verification codes.
es: Tu correo electrónico solo se usa para la autenticación y el recuento de uso de la prueba gratuita del LLM (100 veces por defecto). No se recopilan contraseñas: el inicio de sesión usa códigos de verificación por correo.
fr: Votre e-mail sert uniquement à l'authentification et au comptage des essais gratuits du LLM (100 fois par défaut). Aucun mot de passe n'est collecté — la connexion se fait par codes de vérification e-mail.
zh_hans: 仅用于账号登录和 LLM 免费试用次数统计（默认 100 次）。不收集密码，登录使用邮箱验证码。
zh_hant: 僅用於帳號登入和 LLM 免費試用次數統計（預設 100 次）。不收集密碼，登入使用郵件驗證碼。

source: AI Optimize
es: Optimizar con IA
fr: Optimisation IA
zh_hans: AI 一键优化
zh_hant: AI 一鍵優化

# ai_optimize_apply
source: Apply
es: Aplicar
fr: Appliquer
zh_hans: 应用
zh_hant: 套用

# ai_optimize_direction_brighten
source: Brighten
es: Iluminar
fr: Éclaircir
zh_hans: 提亮
zh_hant: 提亮

# ai_optimize_direction_clarity
source: Clarity
es: Claridad
fr: Clarté
zh_hans: 清晰
zh_hant: 清晰

# ai_optimize_direction_cool
source: Cool
es: Frío
fr: Froid
zh_hans: 冷色
zh_hant: 冷色

# ai_optimize_direction_crisp
source: Crisp
es: Nítido
fr: Net
zh_hans: 锐利
zh_hant: 銳利

# ai_optimize_direction_vivid
source: Vivid
es: Vívido
fr: Éclatant
zh_hans: 鲜艳
zh_hant: 鮮豔

# ai_optimize_direction_warm
source: Warm
es: Cálido
fr: Chaud
zh_hans: 暖色
zh_hant: 暖色

# ai_optimize_dismiss
source: Close
es: Cerrar
fr: Fermer
zh_hans: 关闭
zh_hant: 關閉

# ai_optimize_explain_document
source: Detected a document — enhanced text sharpness
es: Se detectó un documento: texto más nítido
fr: Document détecté — netteté du texte renforcée
zh_hans: 检测到文档，已增强文字清晰度
zh_hant: 偵測到文件，已增強文字清晰度

# ai_optimize_explain_food
source: Detected food — boosted color and appeal
es: Se detectó comida: más color y atractivo
fr: Nourriture détectée — couleurs et attrait renforcés
zh_hans: 检测到美食，已增强色彩与食欲感
zh_hant: 偵測到美食，已增強色彩與食慾感

# ai_optimize_explain_general
source: Applied general optimization
es: Se aplicó una optimización general
fr: Optimisation générale appliquée
zh_hans: 已应用通用优化
zh_hant: 已套用一般最佳化

# ai_optimize_explain_group
source: Detected a group photo — evenly enhanced faces and overall tone
es: Se detectó una foto de grupo: rostros y tono general mejorados uniformemente
fr: Photo de groupe détectée — visages et ton général uniformément améliorés
zh_hans: 检测到合影，已均匀优化人脸与整体色调
zh_hant: 偵測到合影，已均勻最佳化人臉與整體色調

# ai_optimize_explain_landscape
source: Detected a landscape — improved clarity and color depth
es: Se detectó un paisaje: mayor claridad y profundidad de color
fr: Paysage détecté — clarté et profondeur des couleurs améliorées
zh_hans: 检测到风景，已提升通透度与色彩层次
zh_hant: 偵測到風景，已提升通透度與色彩層次

# ai_optimize_explain_low_light
source: Detected a low-light shot — lifted shadows and reduced noise
es: Se detectó una toma con poca luz: sombras aclaradas y menos ruido
fr: Photo en faible lumière détectée — ombres éclaircies et bruit réduit
zh_hans: 检测到夜景，已提亮暗部并降低噪感
zh_hant: 偵測到夜景，已提亮暗部並降低噪感

# ai_optimize_explain_portrait
source: Detected a portrait — optimized skin tone and lighting
es: Se detectó un retrato: tono de piel e iluminación optimizados
fr: Portrait détecté — teint et éclairage optimisés
zh_hans: 检测到人像，已优化肤色与光影
zh_hant: 偵測到人像，已最佳化膚色與光影

# ai_optimize_explain_selfie
source: Detected a selfie — applied gentle skin smoothing, brightening and tone lift
es: Se detectó un selfie: suavizado de piel sutil, más brillo y tono realzado
fr: Selfie détecté — lissage doux de la peau, éclaircissement et tons rehaussés
zh_hans: 检测到自拍，已适度磨皮美白并提亮肤色
zh_hant: 偵測到自拍，已適度磨皮美白並提亮膚色

# ai_optimize_failed
source: AI optimization failed: %@
es: La optimización con IA falló: %@
fr: Échec de l'optimisation IA : %@
zh_hans: AI 优化失败：%@
zh_hant: AI 優化失敗：%@

# ai_optimize_keep_hint
source: AI thinks the original looks best — you can still preview candidates
es: La IA cree que la original es la mejor; aun así puedes previsualizar las opciones
fr: L'IA pense que l'original est le meilleur — vous pouvez tout de même prévisualiser les propositions
zh_hans: AI 认为原图已很好，仍可试看候选
zh_hant: AI 認為原圖已很好，仍可試看候選

# ai_optimize_not_available
source: AI optimization is not available
es: La optimización con IA no está disponible
fr: L'optimisation IA n'est pas disponible
zh_hans: AI 优化暂不可用
zh_hant: AI 優化暫不可用

# ai_optimize_pick_hint
source: Tap a card to preview it full-size, then Apply
es: Toca una tarjeta para previsualizarla a tamaño completo y luego toca Aplicar
fr: Touchez une carte pour la prévisualiser en grand, puis touchez Appliquer
zh_hans: 点卡片在大图上预览，确认后点应用
zh_hant: 點卡片在大圖上預覽，確認後點套用

# ai_optimize_recommended
source: Recommended
es: Recomendado
fr: Recommandé
zh_hans: 推荐
zh_hant: 推薦

# ai_optimize_reroll
source: Try another set
es: Probar otro conjunto
fr: Essayer une autre série
zh_hans: 换一组
zh_hant: 換一組

# analysis.failed
source: Analysis failed. Please try again.
es: El análisis falló. Inténtalo de nuevo.
fr: Échec de l'analyse. Veuillez réessayer.
zh_hans: 分析失败，请重试
zh_hant: 分析失敗，請重試

# analysis.low.memory
source: Not enough memory to run analysis. Close other apps and retry.
es: No hay memoria suficiente para ejecutar el análisis. Cierra otras apps e inténtalo de nuevo.
fr: Mémoire insuffisante pour l'analyse. Fermez d'autres applications et réessayez.
zh_hans: 内存不足，无法运行分析，请关闭其他应用后重试
zh_hant: 記憶體不足，無法執行分析，請關閉其他應用後重試

source: Analyzing…
es: Analizando…
fr: Analyse…
zh_hans: 正在分析…
zh_hant: 正在分析…

# avatar_capture_hint
source: Capture avatar
es: Capturar avatar
fr: Capturer l'avatar
zh_hans: 拍摄头像
zh_hant: 拍攝頭像

# beauty_preview_unavailable
source: Beauty effects will be supported in a later version
es: Los efectos de belleza se admitirán en una versión posterior
fr: Les effets d'embellissement seront pris en charge dans une prochaine version
zh_hans: 美颜效果将在后续版本支持
zh_hant: 美顏效果將在後續版本支持

source: chars
es: caracteres
fr: caractères
zh_hans: 字
zh_hant: 字

# chat.chart_failed
source: Chart generation failed: %@
es: Error al generar el gráfico: %@
fr: Échec de la génération du graphique : %@
zh_hans: 图表生成失败：%@
zh_hant: 圖表生成失敗：%@

# chat.command_executed
source: ✅ Executed %@
es: ✅ Se ejecutó %@
fr: ✅ Exécuté : %@
zh_hans: ✅ 已执行 %@
zh_hant: ✅ 已執行 %@

# chat.script_failed
source: Script execution failed: %@
es: Error al ejecutar el script: %@
fr: Échec de l'exécution du script : %@
zh_hans: 脚本执行失败：%@
zh_hant: 腳本執行失敗：%@

# chat_gacha_confirm_failed
source: Failed to apply, please try again
es: No se pudo aplicar; inténtalo de nuevo
fr: Échec de l'application, veuillez réessayer
zh_hans: 应用失败，请重试
zh_hant: 套用失敗，請重試

# chat_gacha_expired
source: This candidate set has expired — start a new optimization
es: Este conjunto de opciones ha caducado; inicia una nueva optimización
fr: Cette série de propositions a expiré — lancez une nouvelle optimisation
zh_hans: 该组候选已过期，可重新发起优化
zh_hant: 該組候選已過期，可重新發起優化

# chat_gacha_pick_hint
source: Tap a card to preview it, then confirm
es: Toca una tarjeta para previsualizarla y luego confirma
fr: Touchez une carte pour la prévisualiser, puis confirmez
zh_hans: 点选一张候选预览，确认后应用
zh_hant: 點選一張候選預覽，確認後套用

# chat_gacha_reroll_unavailable
source: Shuffling is unavailable right now
es: Cambiar de conjunto no está disponible ahora mismo
fr: Le mélange est indisponible pour le moment
zh_hans: 换一组暂不可用，请稍后再试
zh_hant: 換一組暫不可用，請稍後再試

# chat_gacha_use_this
source: Use this
es: Usar esta
fr: Utiliser celle-ci
zh_hans: 就用这张
zh_hant: 就用這張

# copied.toast
source: Copied
es: Copiado
fr: Copié
zh_hans: 已复制
zh_hant: 已複製

# dedup_auto_clear
source: Auto-cleared after 30 days
es: Se borra automáticamente tras 30 días
fr: Effacées automatiquement après 30 jours
zh_hans: 30 天后自动清除
zh_hant: 30 天後自動清除

# dedup_never_scanned
source: Never scanned
es: Nunca escaneado
fr: Jamais analysé
zh_hans: 从未扫描
zh_hant: 從未掃描

# dedup_recycle_bin
source: Trash
es: Papelera
fr: Corbeille
zh_hans: 回收站
zh_hant: 回收站

source: e.g. childhood buddy, second son
es: p. ej., amigo de la infancia, segundo hijo
fr: ex. ami d'enfance, deuxième fils
zh_hans: 如：发小、二儿子
zh_hant: 如：髮小、二兒子

# editor_feature_unavailable
source: This feature is coming soon
es: Esta función estará disponible próximamente
fr: Cette fonctionnalité arrive bientôt
zh_hans: 该功能敬请期待
zh_hant: 此功能敬請期待

# editor_load_failed
source: Failed to load image
es: No se pudo cargar la imagen
fr: Impossible de charger l'image
zh_hans: 图片加载失败
zh_hant: 圖片載入失敗

# editor_load_failed_with_reason
source: Failed to load image: %1$@
es: No se pudo cargar la imagen: %1$@
fr: Impossible de charger l'image : %1$@
zh_hans: 图片加载失败：%1$@
zh_hant: 圖片載入失敗：%1$@

# editor_save_failed
source: Save failed
es: Error al guardar
fr: Échec de l'enregistrement
zh_hans: 保存失败
zh_hant: 儲存失敗

# editor_save_failed_with_reason
source: Save failed: %1$@
es: Error al guardar: %1$@
fr: Échec de l'enregistrement : %1$@
zh_hans: 保存失败：%1$@
zh_hant: 儲存失敗：%1$@

# filter_cool
source: Cool
es: Frío
fr: Froid
zh_hans: 冷色
zh_hant: 冷色
